app/views/results/index.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 ORDER BY "orders"."id" ASC LIMIT 1  [["id", 25]]
---
      	<td><%= test.status %></td>
      	<td><%= link_to test.order_id, purchase_path(test.order) %></td>