app/controllers/administrators_controller.rb

INSERT INTO "users" ("active", "confirmation_sent_at", "confirmation_token", "created_at", "email", "encrypted_password", "first_name", "last_name", "role", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @administrator = User.new(administrator_params)
    @administrator.role = User::ROLES[:administrator]
    if @administrator.save

SELECT "users".* FROM "users" WHERE "users"."id" = 3 ORDER BY "users"."id" ASC LIMIT 1
---
    def set_administrator
      @administrator = User.find(params[:id])