app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 7
---
  def index
    @orders = Order.where(:user => @customer)

INSERT INTO "orders" ("created_at", "memo", "payment_type", "quantity", "total", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Sat, 30 Nov 2013 23:37:07 UTC +00:00], ["memo", "ASD"], ["payment_type", "Cash"], ["quantity", 1], ["total", 50.0], ["updated_at", Sat, 30 Nov 2013 23:37:07 UTC +00:00]]
---
  def create
    @order = @customer.orders.new(order_params)
    @order.creator = current_user
    respond_to do |format|
      if @order.save

UPDATE "orders" SET "payment_type" = $1, "updated_at" = $2 WHERE "orders"."id" = 1  [["payment_type", "PayPal"], ["updated_at", Sun, 01 Dec 2013 00:16:01 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 ORDER BY "orders"."id" ASC LIMIT 1  [["id", 12]]
---
    def set_order
      @order = Order.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 16 ORDER BY "users"."id" ASC LIMIT 1
---
    def set_customer
      @customer = User.find(params[:user_id].to_i)