app/controllers/results_controller.rb

  def set_test
    if current_user.admin?
      test = Test.find(params[:id])
      redirect_to user_test_path(test.user, test) and return
    end
    test = current_user.tests.where(id: params[:id])
    @customer = current_user
    if test.empty?
---
SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", "39"]]
SELECT "tests".* FROM "tests" INNER JOIN "orders" ON "tests"."order_id" = "orders"."id" WHERE "orders"."user_id" = $1 AND "tests"."id" = 29 ORDER BY "tests"."id" ASC LIMIT 1  [["user_id", 19]]
SELECT "users".* FROM "users" WHERE "users"."id" = 24 ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "tests" INNER JOIN "orders" ON "tests"."order_id" = "orders"."id" WHERE "orders"."user_id" = $1 AND "tests"."id" = 118  [["user_id", 16]]