app/controllers/strains_controller.rb

  def create
    @strain = Strain.new(strain_params)
    if @strain.save
---
INSERT INTO "strains" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Mon, 10 Feb 2014 02:02:45 UTC +00:00], ["name", "Another Test"], ["updated_at", Mon, 10 Feb 2014 02:02:45 UTC +00:00]]

  def update
    if @strain.update(strain_params)
---
UPDATE "strains" SET "name" = $1, "updated_at" = $2 WHERE "strains"."id" = 1  [["name", "2 Eyed Jamaican"], ["updated_at", Mon, 10 Feb 2014 01:44:46 UTC +00:00]]