app/controllers/tests_controller.rb

UPDATE "tests" SET "cbd" = $1, "cbg" = $2, "cbc" = $3, "thca" = $4, "status" = $5, "updated_at" = $6, "completed_at" = $7 WHERE "tests"."id" = 3  [["cbd", 2.0], ["cbg", 4.0], ["cbc", 5.0], ["thca", 6.0], ["status", "COMPLETE"], ["updated_at", Thu, 16 Jan 2014 03:37:26 UTC +00:00], ["completed_at", Thu, 16 Jan 2014 03:37:26 UTC +00:00]]
---
  def update
    update_params = test_params
    current_status = @test.status
    update_params.merge!(status: @test.next_status) if params[:update_status] # only do this when the button is clicked
    update_params.merge!(updated_by: current_user)
    respond_to do |format|
      if @test.update(update_params)

SELECT "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT 1  [["id", "6"]]
---
    def set_test
      @test = Test.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 16 ORDER BY "users"."id" ASC LIMIT 1
---
    def set_customer
      @customer = User.find(params[:user_id].to_i)