app/controllers/users_controller.rb

INSERT INTO "users" ("active", "address1", "address2", "city", "control_number", "country", "created_at", "email", "expires_on", "first_name", "invitation_created_at", "invitation_sent_at", "invitation_token", "invited_by_id", "invited_by_type", "issued_on", "last_name", "registration_number", "state", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save

UPDATE "users" SET "state" = $1, "registration_number" = $2, "issued_on" = $3, "expires_on" = $4, "updated_at" = $5 WHERE "users"."id" = 5  [["state", "AR"], ["registration_number", ""], ["issued_on", Sun, 24 Nov 2013], ["expires_on", Sun, 24 Nov 2013], ["updated_at", Sun, 24 Nov 2013 20:00:17 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)