app/views/tests/_form.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 ORDER BY "orders"."id" ASC LIMIT 1  [["id", 7]]
---
	<strong>Order #</strong>
	<%= link_to @test.order_id, user_order_path(@customer, @test.order) %>

SELECT "strains".* FROM "strains" WHERE "strains"."id" = $1 ORDER BY "strains"."id" ASC LIMIT 1  [["id", 2]]
---

  	<%= f.input :strain, :collection => Strain.all, :selected => @test.strain, :include_blank => true %>